Mega-Chonker/.config/emacs/config.org
#+TITLE: Emacs Config
#+AUTHOR: Mleciu
#+DESCRIPTION: My first emacs config. Done with help of DT's Configuring Emacs Series
#+STARTUP: showeverything
#+OPTIONS: toc:2

* Table Of Contents :toc:
- [[#language-support][Language Support]]
- [[#appearance][Appearance]]
  - [[#fonts][Fonts]]
  - [[#disable-unnecessary-things][Disable Unnecessary Things]]
  - [[#display-line-numbers-and-truncated-lines][Display Line Numbers and Truncated Lines]]
  - [[#zomming-inout][Zomming In/Out]]
  - [[#cattpuccin-theme][Cattpuccin Theme]]
  - [[#transparency][Transparency]]
- [[#backup-files][Backup Files]]
- [[#custom-functions][Custom Functions]]
  - [[#buffer-move][Buffer Move]]
  - [[#reload][Reload]]
  - [[#auto-brackets][Auto Brackets]]
  - [[#indentation][Indentation]]
  - [[#minibuffer-one-escape-to-exit][Minibuffer One Escape To Exit]]
  - [[#delete-selected-text-on-typing][Delete Selected Text On Typing]]
- [[#programs-to-load][Programs To Load]]
  - [[#elpaca-package-manager][Elpaca (Package Manager)]]
  - [[#evil-mode-vim][Evil Mode (VIM)]]
  - [[#general-keybindings-keybinds][General Keybindings (Keybinds)]]
  - [[#which-key-list-of-keybinds][Which Key (List of keybinds)]]
  - [[#sudo-edit-add-a-sudo-to-file][SUDO EDIT (Add a sudo to file)]]
  - [[#all-the-icons-icons][All The Icons (Icons)]]
  - [[#ivy-counselcompletion-mechanism][Ivy, Counsel(Completion Mechanism)]]
  - [[#shells-terminals][Shells, Terminals]]
  - [[#projectile][Projectile]]
  - [[#perspective][Perspective]]
  - [[#diminish-hide-apps-in-bottom-line][Diminish (Hide Apps in bottom line)]]
  - [[#tldr][TLDR]]
  - [[#company-auto-complete][Company (Auto Complete)]]
  - [[#flycheck-syntax-check][Flycheck (Syntax Check)]]
  - [[#dired-addons][Dired Addons]]
  - [[#neotree-vscode-side-panel][Neotree (vscode side panel)]]
  - [[#modeline-this-status-bar-at-the-bottom][Modeline (this status bar at the bottom)]]
  - [[#centaur-tabs-tabs][Centaur Tabs (Tabs)]]
  - [[#aggressive-indentindentation][Aggressive Indent(Indentation)]]
  - [[#rainbow-delimiters][Rainbow Delimiters]]
  - [[#org-auto-tangle][Org Auto Tangle]]
- [[#org-mode][Org Mode]]
  - [[#enabling-table-of-contents][Enabling Table Of Contents]]
  - [[#enabling-bullets][Enabling Bullets]]
  - [[#disable-electric-indent][Disable Electric Indent]]
  - [[#org-to-latex-to-pdf][Org To Latex To PDF]]
  - [[#org-tempo][Org Tempo]]

* Language Support
Emacs has built-in programming language modes for Lisp, Scheme, DSSSL, Ada, ASM, AWK, C, C++, Fortran, Icon, IDL (CORBA), IDLWAVE, Java, Javascript, M4, Makefiles, Metafont, Modula2, Object Pascal, Objective-C, Octave, Pascal, Perl, Pike, PostScript, Prolog, Python, Ruby, Simula, SQL, Tcl, Verilog, and VHDL.
#+begin_src emacs-lisp

#+end_src

* Appearance
** Fonts
#+begin_src emacs-lisp
(set-face-attribute 'default nil
  :font "JetBrains Mono Nerd Font"
  :height 110
  :weight 'medium)
(set-face-attribute 'variable-pitch nil
  :font "Jetbrains Mono Nerd Font"
  :height 120
  :weight 'medium)
(set-face-attribute 'fixed-pitch nil
  :font "JetBrains Mono Nerd Font"
  :height 110
  :weight 'medium)
(set-face-attribute 'font-lock-comment-face nil
  :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
  :slant 'italic)
(add-to-list 'default-frame-alist '(font . "JetBrains Mono Nerd Font-11"))
(setq-default line-spacing 0.12)
#+end_src

** Disable Unnecessary Things
#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

** Display Line Numbers and Truncated Lines
#+begin_src emacs-lisp
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
#+end_src

** Zomming In/Out
#+begin_src emacs-lisp
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
#+end_src

** Cattpuccin Theme
#+begin_src emacs-lisp
(add-to-list 'custom-theme-load-path "~/.config/emacs/Themes")
(load-theme 'catppuccin t)
(setq catppuccin-flavor 'mocha)
#+end_src

** Transparency
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(alpha-background . 80))
#+end_src

* Backup Files
#+begin_src emacs-lisp
(setq auto-save-file-name-transforms '((".*" "~/.autosaves/" t)))
(setq make-backup-files nil)
#+end_src

* Custom Functions
** Buffer Move
#+begin_src emacs-lisp
(require 'windmove)

;;;###autoload
(defun buf-move-up ()
  (interactive)
  (let* ((other-win (windmove-find-other-window 'up))
	 (buf-this-buf (window-buffer (selected-window))))
    (if (null other-win)
        (error "No window above this one")
      (set-window-buffer (selected-window) (window-buffer other-win))
      (set-window-buffer other-win buf-this-buf)
      (select-window other-win))))

;;;###autoload
(defun buf-move-down ()
  (interactive)
  (let* ((other-win (windmove-find-other-window 'down))
	 (buf-this-buf (window-buffer (selected-window))))
    (if (or (null other-win) 
            (string-match "^ \\*Minibuf" (buffer-name (window-buffer other-win))))
        (error "No window under this one")
      (set-window-buffer (selected-window) (window-buffer other-win))
      (set-window-buffer other-win buf-this-buf)
      (select-window other-win))))

;;;###autoload
(defun buf-move-left ()
  (interactive)
  (let* ((other-win (windmove-find-other-window 'left))
	 (buf-this-buf (window-buffer (selected-window))))
    (if (null other-win)
        (error "No left split")
      (set-window-buffer (selected-window) (window-buffer other-win))
      (set-window-buffer other-win buf-this-buf)
      (select-window other-win))))

;;;###autoload
(defun buf-move-right ()
  (interactive)
  (let* ((other-win (windmove-find-other-window 'right))
	 (buf-this-buf (window-buffer (selected-window))))
    (if (null other-win)
        (error "No right split")
      (set-window-buffer (selected-window) (window-buffer other-win))
      (set-window-buffer other-win buf-this-buf)
      (select-window other-win))))
#+end_src

** Reload
#+begin_src emacs-lisp
(defun reload-init-file ()
  (interactive)
  (load-file user-init-file)
  (load-file user-init-file))
#+end_src

** Auto Brackets
#+begin_src emacs-lisp
(electric-pair-mode 1)
(setq electric-pair-preserve-balance nil)
(add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                   `(lambda (c)
                  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
#+end_src

** Indentation
#+begin_src emacs-lisp
(setq indent-tabs-mode nil)
(setq tab-width 4)
(setq-default c-basic-offset 4)
(setq-default evil-shift-width tab-width)
(define-key global-map (kbd "RET") 'newline-and-indent)
#+end_src

** Minibuffer One Escape To Exit
#+begin_src emacs-lisp
(global-set-key [escape] 'keyboard-escape-quit)
#+end_src

** Delete Selected Text On Typing
#+begin_src emacs-lisp
(delete-selection-mode 1)
#+end_src

* Programs To Load
** Elpaca (Package Manager)
#+begin_src emacs-lisp
(defvar elpaca-installer-version 0.5)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

(elpaca elpaca-use-package
  (elpaca-use-package-mode)
  (setq elpaca-use-package-by-default t))

(elpaca-wait)
#+end_src

** Evil Mode (VIM)
#+begin_src emacs-lisp
(use-package evil
    :diminish
    :init      
    (setq evil-want-integration t) 
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (evil-mode))
  (use-package evil-collection
    :after evil
    :config
    (setq evil-collection-mode-list '(dashboard dired ibuffer))
    (evil-collection-init))
  (use-package evil-tutor)
#+end_src

