Mega-Chonker/.config/emacs/config.el

(require 'org-tempo)
